{
"name" : "자동 조합",
"icon" : "minecraft:crafting_table",
"priority" : "true",
"category" : "refstoragemanual:auto_crafting",
"pages" : [
{
"type" : "text",
"text" : "Refined Storage의 자동 조합 기능은 조합 과정을 자동화하여, 아이템을 수동으로 조합 격자로 옮기지 않고도 조합할 수 있게 해줍니다. 조합 격자를 사용하면 Refined Storage가 자동으로 처리할 조합 작업을 시작할 수 있어, 이 과정을 더욱 효율적이고 시간 소모를 줄여줍니다."
},
{
"type" : "text",
"text" : "패턴$(br)Refined Storage에 조합법을 가르치려면 $(l:pattern_grid)패턴 격자$()를 사용합니다. 이 패턴 격자는 $(l:pattern)패턴$()을 생성합니다. 패턴은 조합하려는 아이템의 조합법을 포함합니다.$(br2)패턴 종속성$(br)자동으로 조합하려는 각 하위 아이템에 대해 패턴을 생성해야 합니다. Refined Storage는 먼저 저장 공간에서 하위 아이템을 추출하려고 시도하지만, 사용할 수 없는 경우 해당 하위 아이템을 만드는 방법을 알기 위해 하위 아이템의 패턴으로 대체합니다. 하위 아이템에 대한 패턴이 없으면 하위 아이템이 \"누락됨\"으로 표시되고 자동 조합 작업을 실행할 수 없습니다."
},
{
"type" : "text",
"text" : "예시: 상자를 자동 조합하고 싶다고 가정해 봅시다.$(br)상자용 패턴을 생성합니다.$(br)상자를 만드는 데 사용되는 목재 판자용 패턴을 생성합니다.$(br)패턴을 생성하지 않고 목재 판자가 있다면 Refined Storage는 해당 판자를 사용할 수 있습니다.$(br)판자가 부족하면 Refined Storage는 무엇을 해야 할지 모릅니다.$(br)패턴을 생성하지 않고 목재 판자가 없다면 Refined Storage는 이 아이템을 조합하는 방법을 알지 못하며 조합 작업을 실행할 수 없습니다."
},
{
"type" : "text",
"text" : "정확 모드$(br)정확 모드는 기본적으로 켜져 있으며, 이는 모든 패턴이 \"정확한 패턴\"임을 의미합니다. 즉, Refined Storage는 패턴에 정의된 대로 정확히 아이템을 가져옵니다. 정확 모드가 꺼져 있으면 해당 조합법에 허용되는 다른 입력(다른 종류의 나무 등)도 일치시킵니다."
},
{
"type" : "text",
"text" : "$(l:crafter)조합기$()$(br)패턴을 생성했다면, 조합기를 만들고 저장 네트워크에 연결합니다.$(br)이 조합기 안에 모든 패턴을 저장합니다.$(br2)아이템 요청하기$(br)아이템을 조합하는 데 필요한 관련 패턴이 조합기에 저장되는 즉시, 모든 격자를 통해 아이템을 요청할 수 있습니다. 자동 조합하려는 아이템을 클릭하여 이 작업을 수행할 수 있습니다. 아이템이 이미 사용 가능하고 해당 아이템을 더 요청하려면 CTRL + SHIFT 키 조합을 사용하여 조합 창을 열 수 있습니다. 아이템을 요청할 때 Refined Storage는 먼저 해당 아이템을 몇 개 조합할지 묻습니다. 그런 다음, 어떤 아이템을 가져오거나 조합할지 보여줍니다. 누락된 아이템이 있는 경우, 조합 작업은 CTRL + SHIFT를 눌러야만 시작할 수 있습니다."
},
{
"type" : "text",
"text" : "조합 작업 모니터링$(br)조합 모니터를 만들고 저장 네트워크에 연결하여 조합 작업이 어떻게 진행되는지 확인할 수 있습니다. 이곳에서 자동 조합 작업을 취소할 수도 있습니다. 무선 조합 모니터를 사용하여 인벤토리에서 원격으로 실행 중인 조합 작업을 확인할 수도 있습니다."
},
{
"type" : "text",
"text" : "패턴을 편리하게 관리하기$(br)저장 네트워크의 조합기에 있는 모든 패턴에 편리하게 접근하고 싶으신가요? $(l:crafting_manager)조합기 관리자$()를 사용해 보세요.$(br2)조합 작업 속도 높이기$(br)조합기에 $(l:upgradesrs)속도 업그레이드$()를 삽입합니다."
}
]
}